add_3_and_double(X,Y):-
  Y is (X+3)*2.

/** <examples> Your example queries go here, e.g.
?- 8 is 6+2.
?- 12 is 6*2.
?- -2 is 6-8.
?- 3 is 6/2.
?- 1 is mod(7,2).
?- X is 6+2.
?- X is 6*2.
?- X is 6-8.
?- X is 6/2.
?- X is mod(7,2).
?- add_3_and_double(1,X).
?- add_3_and_double(2,X).
?- X is 3+2*4.
*/
